import { CommonIconProps } from '@src/werkzeug/defs/components';
import useIconSizing from '@src/werkzeug/hooks/common/useIconSizing';

import classNames from 'classnames/bind';
import styles from './Icon.module.scss';
const cx = classNames.bind(styles);

/**
 * 뒤로가기 아이콘
 */
function ErrorImgIcon({
  size = 'default',
  color = 'currentColor',
  fill = 'none',
}: CommonIconProps) {
  const sx = useIconSizing(size);

  return (
    <div className={cx('IconBox')}>
      <svg width={ sx||80 } height={ sx||80 } viewBox="0 0 80 80" fill={ fill } xmlns="http://www.w3.org/2000/svg">
        <path d="M70.2 14.8104C69.2667 13.8771 68 13.3438 66.6667 13.3438H11.6667C10.3333 13.3438 9.06667 13.8771 8.13333 14.8104C7.2 15.7437 6.66667 17.0104 6.66667 18.3438V63.3438C6.66667 64.6771 7.2 65.9437 8.13333 66.8771C9.06667 67.8104 10.3333 68.3438 11.6667 68.3438H66.6667C68 68.3438 69.2667 67.8104 70.2 66.8771C71.1333 65.9437 71.6667 64.6771 71.6667 63.3438V18.3438C71.6667 17.0104 71.1333 15.7437 70.2 14.8104ZM66.6667 24.7771V52.3104L57.7 43.3438C56.7667 42.4104 55.5 41.9104 54.1667 41.9104C52.8333 41.9104 51.5667 42.4437 50.6333 43.3438L44.1667 49.8104L40.4667 46.1104L19.7667 62.9771L19.8667 63.1104H19.6L14.8333 66.9771L11.6667 63.1104L8.5 59.2438L11.6667 56.6771V52.3104L13.7 55.0104L33.3667 39.0104L30.2 35.8438C29.2667 34.9104 28 34.4104 26.6667 34.4104C25.3333 34.4104 24.0667 34.9438 23.1333 35.8438L11.6667 47.3104V18.3438H58.7333L63.5 14.4771L66.6667 18.3438L69.8333 22.2104L66.6667 24.7771Z" fill={ color }/>
        <path d="M14.8333 66.976L19.6 63.1094H11.6667L14.8333 66.976Z" fill={ color }/>
        <path d="M8.50016 59.2229L11.6668 63.0896V56.6562L8.50016 59.2229Z" fill={ color }/>
        <path d="M63.5004 14.4688L58.7337 18.3354H66.6671L63.5004 14.4688Z" fill={ color }/>
        <path d="M66.6667 24.7771L69.8333 22.2104L66.6667 18.3438V24.7771Z" fill={ color }/>
        <path d="M19.8663 63.1021L19.7663 62.9688L19.5996 63.1021H19.8663Z" fill={ color }/>
        <path d="M11.6667 52.2812V56.6479L13.7 54.9813L11.6667 52.2812Z" fill={ color }/>
        <path fillRule="evenodd" clipRule="evenodd" d="M68.6056 16.7657C69.4772 17.8365 69.3157 19.4112 68.2448 20.2827L13.2448 65.0494C12.174 65.921 10.5993 65.7595 9.72775 64.6887C8.85616 63.6178 9.01767 62.0432 10.0885 61.1716L65.0885 16.4049C66.1593 15.5333 67.734 15.6948 68.6056 16.7657Z" fill={ color }/>
      </svg>
    </div>
  );
}

export default ErrorImgIcon;
